Revit 2027 API
SphericalLightDistribution Constructor
Overload List
Name | Description
SphericalLightDistribution() |  Creates a spherical light distribution object.
SphericalLightDistribution(SphericalLightDistribution) |  Creates a copy of the given spherical light distribution
Top
See Also
Reference
SphericalLightDistribution Class
Autodesk.Revit.DB.Lighting Namespace